#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HUD

#include "Basic.hpp"

#include "Squad_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIZOrderStruct_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function BP_HUD.BP_HUD_C.Zoom Updated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_Zoom_Updated__DelegateSignature final
{
public:
	float                                         Zoom_Amount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Zoom_Updated__DelegateSignature) == 0x000004, "Wrong alignment on BP_HUD_C_Zoom_Updated__DelegateSignature");
static_assert(sizeof(BP_HUD_C_Zoom_Updated__DelegateSignature) == 0x000004, "Wrong size on BP_HUD_C_Zoom_Updated__DelegateSignature");
static_assert(offsetof(BP_HUD_C_Zoom_Updated__DelegateSignature, Zoom_Amount) == 0x000000, "Member 'BP_HUD_C_Zoom_Updated__DelegateSignature::Zoom_Amount' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Menu Closed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_Menu_Closed__DelegateSignature final
{
public:
	class UUMG_MenuBase_C*                        Menu;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Menu_Closed__DelegateSignature) == 0x000008, "Wrong alignment on BP_HUD_C_Menu_Closed__DelegateSignature");
static_assert(sizeof(BP_HUD_C_Menu_Closed__DelegateSignature) == 0x000008, "Wrong size on BP_HUD_C_Menu_Closed__DelegateSignature");
static_assert(offsetof(BP_HUD_C_Menu_Closed__DelegateSignature, Menu) == 0x000000, "Member 'BP_HUD_C_Menu_Closed__DelegateSignature::Menu' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Menu Opened__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_Menu_Opened__DelegateSignature final
{
public:
	class UUMG_MenuBase_C*                        Menu;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Menu_Opened__DelegateSignature) == 0x000008, "Wrong alignment on BP_HUD_C_Menu_Opened__DelegateSignature");
static_assert(sizeof(BP_HUD_C_Menu_Opened__DelegateSignature) == 0x000008, "Wrong size on BP_HUD_C_Menu_Opened__DelegateSignature");
static_assert(offsetof(BP_HUD_C_Menu_Opened__DelegateSignature, Menu) == 0x000000, "Member 'BP_HUD_C_Menu_Opened__DelegateSignature::Menu' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ExecuteUbergraph_BP_HUD
// 0x03D0 (0x03D0 - 0x0000)
struct BP_HUD_C_ExecuteUbergraph_BP_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449F[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A0[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQCloudServicesSubsystem*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeX;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeY;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DamageTaken;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDamageEvent                           K2Node_Event_DamageEvent;                          // 0x0038(0x0010)(ConstParm)
	class APawn*                                  K2Node_Event_PawnInstigator;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class USQVehicleViewWidget>       K2Node_Event_WidgetClass;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A1[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQVehicleViewWidget*                   CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A2[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_WorldMarker_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A3[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQDeployableAmmoBag*                   K2Node_Event_AmmoBag_1;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanPickup;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A4[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQDeployableAmmoBag*                   K2Node_Event_AmmoBag;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Items_C>          K2Node_DynamicCast_AsBPI_Items;                    // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A5[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Items_C>          K2Node_DynamicCast_AsBPI_Items_1;                  // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A6[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Zoom_Amount;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_1;  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_2;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQBaseHudWidget*                       CallFunc_Create_ReturnValue_2;                     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bEnabled;                             // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A7[0x5];                                     // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A8[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Winning_Team;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Losing_Team;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Winning_Tickets;                // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Losing_Tickets;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A9[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayerController_ReturnValue_3;  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AA[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Scoreboard_C>     K2Node_DynamicCast_AsBPI_Scoreboard;               // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AB[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_EndRound_Base_C*                     CallFunc_Create_ReturnValue_3;                     // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQMapMarker*                           K2Node_Event_Marker;                               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Event_Model;                                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Close_Command;                        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Context;                              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBaseRadialMenu_C*                      CallFunc_CreateRadialMenu_OutputPin;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_MenuBase_C*                        K2Node_Event_Menu;                                 // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Show;                                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Instant;                              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AC[0x6];                                     // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_MenuBase_C*                        K2Node_Event_In_Menu;                              // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Show_Mouse;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AD[0x3];                                     // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Winning_Team;                         // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Losing_Team;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Winning_Tickets;                      // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Loser_Tickets;                        // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIZOrderStruct                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AE[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Axis;                                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQMapMarkerVisualData                 K2Node_Event_MapMarkerVisualData;                  // 0x01A8(0x00C8)(NoDestructor)
	struct FSQMapMarkerVisualData                 K2Node_CustomEvent_MapMarkerVisualData;            // 0x0270(0x00C8)(NoDestructor)
	class UUMG_BaseHUD_C*                         K2Node_DynamicCast_AsUMG_Base_HUD;                 // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44AF[0x6];                                     // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B0[0x7];                                     // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HudWidgetsEnabled_ReturnValue;            // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B1[0x3];                                     // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0364(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44B2[0x4];                                     // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0378(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameStateValid_IsValid;                 // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B3[0x2];                                     // 0x0382(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0384(0x0010)(NoDestructor)
	bool                                          CallFunc_IsEndOfMatch_Out_Is_End_Of_Match;         // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0397(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatingInEditor_ReturnValue;         // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B4[0x6];                                     // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseRadialMenu_C*                      CallFunc_CreateEmoteMenu_OutputPin;                // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B5[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FPlayerData& PlayerData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B6[0x3];                                     // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_BaseHUD_C*                         K2Node_DynamicCast_AsUMG_Base_HUD_1;               // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x000008, "Wrong alignment on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(sizeof(BP_HUD_C_ExecuteUbergraph_BP_HUD) == 0x0003D0, "Wrong size on BP_HUD_C_ExecuteUbergraph_BP_HUD");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, EntryPoint) == 0x000000, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_byte_Variable) == 0x000004, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SizeX) == 0x000028, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SizeX' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_SizeY) == 0x00002C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_SizeY' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_DamageTaken) == 0x000034, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_DamageTaken' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_DamageEvent) == 0x000038, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_PawnInstigator) == 0x000048, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_PawnInstigator' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_FClamp_ReturnValue) == 0x000054, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_WidgetClass) == 0x000058, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_WidgetClass' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_bool_Variable) == 0x000060, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue) == 0x000068, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue) == 0x000070, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_1) == 0x000080, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_3) == 0x000089, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_AmmoBag_1) == 0x000090, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_AmmoBag_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bCanPickup) == 0x000098, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bCanPickup' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_AmmoBag) == 0x0000A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_AmmoBag' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsBPI_Items) == 0x0000A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsBPI_Items' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsBPI_Items_1) == 0x0000C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsBPI_Items_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Zoom_Amount) == 0x0000D4, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Zoom_Amount' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue_1) == 0x0000D8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue_2) == 0x0000E0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_2) == 0x0000E8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_EndPlayReason) == 0x0000F0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_4) == 0x0000F1, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bEnabled) == 0x0000F2, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Actor) == 0x0000F8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Actor' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_bIsVisible) == 0x000100, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_bIsVisible' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Winning_Team) == 0x000104, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Winning_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Losing_Team) == 0x000108, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Losing_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Winning_Tickets) == 0x00010C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Winning_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_Losing_Tickets) == 0x000110, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_Losing_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetOwningPlayerController_ReturnValue_3) == 0x000118, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetOwningPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsVisible_ReturnValue) == 0x000120, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_5) == 0x000121, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_6) == 0x000122, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsVisible_ReturnValue_1) == 0x000123, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsBPI_Scoreboard) == 0x000128, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsBPI_Scoreboard' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_2) == 0x000138, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Create_ReturnValue_3) == 0x000140, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Marker) == 0x000148, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Marker' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Model) == 0x000150, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Model' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Close_Command) == 0x000158, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Close_Command' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Context) == 0x000160, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_CreateRadialMenu_OutputPin) == 0x000168, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_CreateRadialMenu_OutputPin' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Menu) == 0x000170, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Menu' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Show) == 0x000178, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Show' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Instant) == 0x000179, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Instant' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_In_Menu) == 0x000180, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_In_Menu' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Show_Mouse) == 0x000188, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Show_Mouse' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Winning_Team) == 0x00018C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Winning_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Losing_Team) == 0x000190, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Losing_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Winning_Tickets) == 0x000194, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Winning_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Loser_Tickets) == 0x000198, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Loser_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetDataTableRowFromName_OutRow) == 0x00019C, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_Axis) == 0x0001A4, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_Axis' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Event_MapMarkerVisualData) == 0x0001A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Event_MapMarkerVisualData' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CustomEvent_MapMarkerVisualData) == 0x000270, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CustomEvent_MapMarkerVisualData' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsUMG_Base_HUD) == 0x000338, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsUMG_Base_HUD' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_3) == 0x000340, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_7) == 0x000341, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_AddChildToCanvas_ReturnValue) == 0x000348, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_8) == 0x000350, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000358, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_HudWidgetsEnabled_ReturnValue) == 0x000360, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_HudWidgetsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate_1) == 0x000364, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000378, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsValid_ReturnValue_9) == 0x000380, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsGameStateValid_IsValid) == 0x000381, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsGameStateValid_IsValid' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_MakeStruct_Anchors) == 0x000384, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsEndOfMatch_Out_Is_End_Of_Match) == 0x000394, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsEndOfMatch_Out_Is_End_Of_Match' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue) == 0x000395, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsVisible_ReturnValue_2) == 0x000396, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_Not_PreBool_ReturnValue_1) == 0x000397, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_IsSimulatingInEditor_ReturnValue) == 0x000398, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_IsSimulatingInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_BooleanAND_ReturnValue) == 0x000399, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, CallFunc_CreateEmoteMenu_OutputPin) == 0x0003A0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::CallFunc_CreateEmoteMenu_OutputPin' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, Temp_byte_Variable_1) == 0x0003A8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_CreateDelegate_OutputDelegate_2) == 0x0003AC, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_Select_Default) == 0x0003BC, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_AsUMG_Base_HUD_1) == 0x0003C0, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_AsUMG_Base_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_ExecuteUbergraph_BP_HUD, K2Node_DynamicCast_bSuccess_4) == 0x0003C8, "Member 'BP_HUD_C_ExecuteUbergraph_BP_HUD::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.CreateMapMarker
// 0x00C8 (0x00C8 - 0x0000)
struct BP_HUD_C_CreateMapMarker final
{
public:
	struct FSQMapMarkerVisualData                 MapMarkerVisualData;                               // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_HUD_C_CreateMapMarker) == 0x000008, "Wrong alignment on BP_HUD_C_CreateMapMarker");
static_assert(sizeof(BP_HUD_C_CreateMapMarker) == 0x0000C8, "Wrong size on BP_HUD_C_CreateMapMarker");
static_assert(offsetof(BP_HUD_C_CreateMapMarker, MapMarkerVisualData) == 0x000000, "Member 'BP_HUD_C_CreateMapMarker::MapMarkerVisualData' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ShowMarkerOnHUD
// 0x00C8 (0x00C8 - 0x0000)
struct BP_HUD_C_ShowMarkerOnHUD final
{
public:
	struct FSQMapMarkerVisualData                 MapMarkerVisualData;                               // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_HUD_C_ShowMarkerOnHUD) == 0x000008, "Wrong alignment on BP_HUD_C_ShowMarkerOnHUD");
static_assert(sizeof(BP_HUD_C_ShowMarkerOnHUD) == 0x0000C8, "Wrong size on BP_HUD_C_ShowMarkerOnHUD");
static_assert(offsetof(BP_HUD_C_ShowMarkerOnHUD, MapMarkerVisualData) == 0x000000, "Member 'BP_HUD_C_ShowMarkerOnHUD::MapMarkerVisualData' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Zoom In Map Wheel
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_Zoom_In_Map_Wheel final
{
public:
	float                                         Axis;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Zoom_In_Map_Wheel) == 0x000004, "Wrong alignment on BP_HUD_C_Zoom_In_Map_Wheel");
static_assert(sizeof(BP_HUD_C_Zoom_In_Map_Wheel) == 0x000004, "Wrong size on BP_HUD_C_Zoom_In_Map_Wheel");
static_assert(offsetof(BP_HUD_C_Zoom_In_Map_Wheel, Axis) == 0x000000, "Member 'BP_HUD_C_Zoom_In_Map_Wheel::Axis' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.End Match
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_End_Match final
{
public:
	int32                                         Winning_Team;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Losing_Team;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Winning_Tickets;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Loser_Tickets;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_End_Match) == 0x000004, "Wrong alignment on BP_HUD_C_End_Match");
static_assert(sizeof(BP_HUD_C_End_Match) == 0x000010, "Wrong size on BP_HUD_C_End_Match");
static_assert(offsetof(BP_HUD_C_End_Match, Winning_Team) == 0x000000, "Member 'BP_HUD_C_End_Match::Winning_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_End_Match, Losing_Team) == 0x000004, "Member 'BP_HUD_C_End_Match::Losing_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_End_Match, Winning_Tickets) == 0x000008, "Member 'BP_HUD_C_End_Match::Winning_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_End_Match, Loser_Tickets) == 0x00000C, "Member 'BP_HUD_C_End_Match::Loser_Tickets' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Menu Toggle
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_Menu_Toggle final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44B7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_MenuBase_C*                        In_Menu;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Mouse;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_Menu_Toggle) == 0x000008, "Wrong alignment on BP_HUD_C_Menu_Toggle");
static_assert(sizeof(BP_HUD_C_Menu_Toggle) == 0x000018, "Wrong size on BP_HUD_C_Menu_Toggle");
static_assert(offsetof(BP_HUD_C_Menu_Toggle, Instant) == 0x000000, "Member 'BP_HUD_C_Menu_Toggle::Instant' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Menu_Toggle, In_Menu) == 0x000008, "Member 'BP_HUD_C_Menu_Toggle::In_Menu' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Menu_Toggle, Show_Mouse) == 0x000010, "Member 'BP_HUD_C_Menu_Toggle::Show_Mouse' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Show Leaderboard
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_Show_Leaderboard final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_Show_Leaderboard) == 0x000001, "Wrong alignment on BP_HUD_C_Show_Leaderboard");
static_assert(sizeof(BP_HUD_C_Show_Leaderboard) == 0x000001, "Wrong size on BP_HUD_C_Show_Leaderboard");
static_assert(offsetof(BP_HUD_C_Show_Leaderboard, Show) == 0x000000, "Member 'BP_HUD_C_Show_Leaderboard::Show' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Menu Close
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_Menu_Close final
{
public:
	class UUMG_MenuBase_C*                        Menu;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Menu_Close) == 0x000008, "Wrong alignment on BP_HUD_C_Menu_Close");
static_assert(sizeof(BP_HUD_C_Menu_Close) == 0x000008, "Wrong size on BP_HUD_C_Menu_Close");
static_assert(offsetof(BP_HUD_C_Menu_Close, Menu) == 0x000000, "Member 'BP_HUD_C_Menu_Close::Menu' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Create Radial Menu
// 0x0018 (0x0018 - 0x0000)
struct BP_HUD_C_Create_Radial_Menu final
{
public:
	class UClass*                                 Model;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Close_Command;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Context;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Create_Radial_Menu) == 0x000008, "Wrong alignment on BP_HUD_C_Create_Radial_Menu");
static_assert(sizeof(BP_HUD_C_Create_Radial_Menu) == 0x000018, "Wrong size on BP_HUD_C_Create_Radial_Menu");
static_assert(offsetof(BP_HUD_C_Create_Radial_Menu, Model) == 0x000000, "Member 'BP_HUD_C_Create_Radial_Menu::Model' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Create_Radial_Menu, Close_Command) == 0x000008, "Member 'BP_HUD_C_Create_Radial_Menu::Close_Command' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Create_Radial_Menu, Context) == 0x000010, "Member 'BP_HUD_C_Create_Radial_Menu::Context' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Show 3D Marker
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_Show_3D_Marker final
{
public:
	class ASQMapMarker*                           Marker;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Show_3D_Marker) == 0x000008, "Wrong alignment on BP_HUD_C_Show_3D_Marker");
static_assert(sizeof(BP_HUD_C_Show_3D_Marker) == 0x000008, "Wrong size on BP_HUD_C_Show_3D_Marker");
static_assert(offsetof(BP_HUD_C_Show_3D_Marker, Marker) == 0x000000, "Member 'BP_HUD_C_Show_3D_Marker::Marker' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Show End Round Widget
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_Show_End_Round_Widget final
{
public:
	int32                                         Winning_Team;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Losing_Team;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Winning_Tickets;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Losing_Tickets;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Show_End_Round_Widget) == 0x000004, "Wrong alignment on BP_HUD_C_Show_End_Round_Widget");
static_assert(sizeof(BP_HUD_C_Show_End_Round_Widget) == 0x000010, "Wrong size on BP_HUD_C_Show_End_Round_Widget");
static_assert(offsetof(BP_HUD_C_Show_End_Round_Widget, Winning_Team) == 0x000000, "Member 'BP_HUD_C_Show_End_Round_Widget::Winning_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Show_End_Round_Widget, Losing_Team) == 0x000004, "Member 'BP_HUD_C_Show_End_Round_Widget::Losing_Team' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Show_End_Round_Widget, Winning_Tickets) == 0x000008, "Member 'BP_HUD_C_Show_End_Round_Widget::Winning_Tickets' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_Show_End_Round_Widget, Losing_Tickets) == 0x00000C, "Member 'BP_HUD_C_Show_End_Round_Widget::Losing_Tickets' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.BPOnUsableVisible
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_BPOnUsableVisible final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVisible;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_BPOnUsableVisible) == 0x000008, "Wrong alignment on BP_HUD_C_BPOnUsableVisible");
static_assert(sizeof(BP_HUD_C_BPOnUsableVisible) == 0x000010, "Wrong size on BP_HUD_C_BPOnUsableVisible");
static_assert(offsetof(BP_HUD_C_BPOnUsableVisible, Actor) == 0x000000, "Member 'BP_HUD_C_BPOnUsableVisible::Actor' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_BPOnUsableVisible, bIsVisible) == 0x000008, "Member 'BP_HUD_C_BPOnUsableVisible::bIsVisible' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.BPOnSetHudWidgetsEnabled
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_BPOnSetHudWidgetsEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_BPOnSetHudWidgetsEnabled) == 0x000001, "Wrong alignment on BP_HUD_C_BPOnSetHudWidgetsEnabled");
static_assert(sizeof(BP_HUD_C_BPOnSetHudWidgetsEnabled) == 0x000001, "Wrong size on BP_HUD_C_BPOnSetHudWidgetsEnabled");
static_assert(offsetof(BP_HUD_C_BPOnSetHudWidgetsEnabled, bEnabled) == 0x000000, "Member 'BP_HUD_C_BPOnSetHudWidgetsEnabled::bEnabled' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_HUD_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_HUD_C_ReceiveEndPlay");
static_assert(sizeof(BP_HUD_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_HUD_C_ReceiveEndPlay");
static_assert(offsetof(BP_HUD_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_HUD_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.Force Update Zoom
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_Force_Update_Zoom final
{
public:
	float                                         Zoom_Amount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_Force_Update_Zoom) == 0x000004, "Wrong alignment on BP_HUD_C_Force_Update_Zoom");
static_assert(sizeof(BP_HUD_C_Force_Update_Zoom) == 0x000004, "Wrong size on BP_HUD_C_Force_Update_Zoom");
static_assert(offsetof(BP_HUD_C_Force_Update_Zoom, Zoom_Amount) == 0x000000, "Member 'BP_HUD_C_Force_Update_Zoom::Zoom_Amount' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.HideAmmoBagOverlay
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_HideAmmoBagOverlay final
{
public:
	class ASQDeployableAmmoBag*                   Ammobag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_HideAmmoBagOverlay) == 0x000008, "Wrong alignment on BP_HUD_C_HideAmmoBagOverlay");
static_assert(sizeof(BP_HUD_C_HideAmmoBagOverlay) == 0x000008, "Wrong size on BP_HUD_C_HideAmmoBagOverlay");
static_assert(offsetof(BP_HUD_C_HideAmmoBagOverlay, Ammobag) == 0x000000, "Member 'BP_HUD_C_HideAmmoBagOverlay::Ammobag' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.DisplayAmmoBagOverlay
// 0x0010 (0x0010 - 0x0000)
struct BP_HUD_C_DisplayAmmoBagOverlay final
{
public:
	class ASQDeployableAmmoBag*                   Ammobag;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanPickup;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HUD_C_DisplayAmmoBagOverlay) == 0x000008, "Wrong alignment on BP_HUD_C_DisplayAmmoBagOverlay");
static_assert(sizeof(BP_HUD_C_DisplayAmmoBagOverlay) == 0x000010, "Wrong size on BP_HUD_C_DisplayAmmoBagOverlay");
static_assert(offsetof(BP_HUD_C_DisplayAmmoBagOverlay, Ammobag) == 0x000000, "Member 'BP_HUD_C_DisplayAmmoBagOverlay::Ammobag' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_DisplayAmmoBagOverlay, bCanPickup) == 0x000008, "Member 'BP_HUD_C_DisplayAmmoBagOverlay::bCanPickup' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.VehicleCreateOverlay
// 0x0008 (0x0008 - 0x0000)
struct BP_HUD_C_VehicleCreateOverlay final
{
public:
	TSubclassOf<class USQVehicleViewWidget>       WidgetClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_VehicleCreateOverlay) == 0x000008, "Wrong alignment on BP_HUD_C_VehicleCreateOverlay");
static_assert(sizeof(BP_HUD_C_VehicleCreateOverlay) == 0x000008, "Wrong size on BP_HUD_C_VehicleCreateOverlay");
static_assert(offsetof(BP_HUD_C_VehicleCreateOverlay, WidgetClass) == 0x000000, "Member 'BP_HUD_C_VehicleCreateOverlay::WidgetClass' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.BlueprintNotifyHit
// 0x0020 (0x0020 - 0x0000)
struct BP_HUD_C_BlueprintNotifyHit final
{
public:
	float                                         DamageTaken;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44B8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           DamageEvent;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class APawn*                                  PawnInstigator;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HUD_C_BlueprintNotifyHit) == 0x000008, "Wrong alignment on BP_HUD_C_BlueprintNotifyHit");
static_assert(sizeof(BP_HUD_C_BlueprintNotifyHit) == 0x000020, "Wrong size on BP_HUD_C_BlueprintNotifyHit");
static_assert(offsetof(BP_HUD_C_BlueprintNotifyHit, DamageTaken) == 0x000000, "Member 'BP_HUD_C_BlueprintNotifyHit::DamageTaken' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_BlueprintNotifyHit, DamageEvent) == 0x000008, "Member 'BP_HUD_C_BlueprintNotifyHit::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_HUD_C_BlueprintNotifyHit, PawnInstigator) == 0x000018, "Member 'BP_HUD_C_BlueprintNotifyHit::PawnInstigator' has a wrong offset!");

// Function BP_HUD.BP_HUD_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HUD_C_ReceiveTick final
{
public:
