#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapWidgetRepairStation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MapWidgetRepairStation.BP_MapWidgetRepairStation_C.ExecuteUbergraph_BP_MapWidgetRepairStation
// 0x0008 (0x0008 - 0x0000)
struct BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_UniformScale;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation) == 0x000004, "Wrong alignment on BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation");
static_assert(sizeof(BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation) == 0x000008, "Wrong size on BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation");
static_assert(offsetof(BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation, EntryPoint) == 0x000000, "Member 'BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation, K2Node_Event_UniformScale) == 0x000004, "Member 'BP_MapWidgetRepairStation_C_ExecuteUbergraph_BP_MapWidgetRepairStation::K2Node_Event_UniformScale' has a wrong offset!");

// Function BP_MapWidgetRepairStation.BP_MapWidgetRepairStation_C.OnScaleChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_MapWidgetRepairStation_C_OnScaleChanged final
{
public:
	float                                         UniformScale;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MapWidgetRepairStation_C_OnScaleChanged) == 0x000004, "Wrong alignment on BP_MapWidgetRepairStation_C_OnScaleChanged");
static_assert(sizeof(BP_MapWidgetRepairStation_C_OnScaleChanged) == 0x000004, "Wrong size on BP_MapWidgetRepairStation_C_OnScaleChanged");
static_assert(offsetof(BP_MapWidgetRepairStation_C_OnScaleChanged, UniformScale) == 0x000000, "Member 'BP_MapWidgetRepairStation_C_OnScaleChanged::UniformScale' has a wrong offset!");

}

