#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Squad_structs.hpp"
#include "Engine_structs.hpp"
#include "ESQVehicleSpawnerSize_structs.hpp"
#include "ESQVehicleTag_structs.hpp"


namespace SDK::Params
{

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.ExecuteUbergraph_BP_VehicleSpawner
// 0x0048 (0x0048 - 0x0000)
struct BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESQTeam                                       CallFunc_GetTeam_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B06[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B07[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQVehicle*                             K2Node_Event_OutVehicle;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B08[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQVehicle*                             K2Node_CustomEvent_Vehicle;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B09[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ASQVehicle* Vehicle)>    K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B0A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner");
static_assert(sizeof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner) == 0x000048, "Wrong size on BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, EntryPoint) == 0x000000, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_GetTeam_ReturnValue) == 0x000004, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, Temp_int_Variable) == 0x000008, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, K2Node_Event_OutVehicle) == 0x000010, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::K2Node_Event_OutVehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, K2Node_CustomEvent_Vehicle) == 0x000020, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_IsServer_ReturnValue) == 0x000028, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_IsValid_ReturnValue_1) == 0x00003C, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_VehicleSpawner_C_ExecuteUbergraph_BP_VehicleSpawner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.OnNeutralVehicleDestroyed
// 0x0008 (0x0008 - 0x0000)
struct BP_VehicleSpawner_C_OnNeutralVehicleDestroyed final
{
public:
	class ASQVehicle*                             Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_OnNeutralVehicleDestroyed) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_OnNeutralVehicleDestroyed");
static_assert(sizeof(BP_VehicleSpawner_C_OnNeutralVehicleDestroyed) == 0x000008, "Wrong size on BP_VehicleSpawner_C_OnNeutralVehicleDestroyed");
static_assert(offsetof(BP_VehicleSpawner_C_OnNeutralVehicleDestroyed, Vehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_OnNeutralVehicleDestroyed::Vehicle' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.OnVehicleSpawned
// 0x0008 (0x0008 - 0x0000)
struct BP_VehicleSpawner_C_OnVehicleSpawned final
{
public:
	class ASQVehicle*                             OutVehicle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_OnVehicleSpawned) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_OnVehicleSpawned");
static_assert(sizeof(BP_VehicleSpawner_C_OnVehicleSpawned) == 0x000008, "Wrong size on BP_VehicleSpawner_C_OnVehicleSpawned");
static_assert(offsetof(BP_VehicleSpawner_C_OnVehicleSpawned, OutVehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_OnVehicleSpawned::OutVehicle' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_VehicleSpawner_C_UserConstructionScript final
{
public:
	class UBP_SQVehicleSettings_C*                VehicleSettings;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_UserConstructionScript");
static_assert(sizeof(BP_VehicleSpawner_C_UserConstructionScript) == 0x000008, "Wrong size on BP_VehicleSpawner_C_UserConstructionScript");
static_assert(offsetof(BP_VehicleSpawner_C_UserConstructionScript, VehicleSettings) == 0x000000, "Member 'BP_VehicleSpawner_C_UserConstructionScript::VehicleSettings' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.GeneratePreviewMesh
// 0x00D0 (0x00D0 - 0x0000)
struct BP_VehicleSpawner_C_GeneratePreviewMesh final
{
public:
	class USQVehicleSettings*                     L_SelectedVehicle;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_BestPriority;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B0B[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B0C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVehicleSettings*                     K2Node_DynamicCast_AsSQVehicle_Settings;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTeam                                       CallFunc_GetDebugTeam_OutDebugTeam;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B0D[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQEditorPlaySettings*                  CallFunc_GetEditorPlaySettings_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQLayer*                               CallFunc_TryGetEditorSQLayer_OutEditorLayer;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetEditorSQLayer_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B0E[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQFactionSetup*                        CallFunc_TryGetEditorFactionSetup_OutFactionSetup; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetEditorFactionSetup_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B0F[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SQVehicleSettings_C*                K2Node_DynamicCast_AsBP_SQVehicle_Settings;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B10[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_TryGetVehicleWithLayer_OutVehicle;        // 0x0068(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetVehicleWithLayer_ReturnValue;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Editor_GetVehicleToSpawn_Out_Has_Something_To_Spawn; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B11[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVehicleSettings*                     CallFunc_Editor_GetVehicleToSpawn_Out_Selected_Vehicle; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_TryGetVehicleWithBiome_OutVehicle;        // 0x00A0(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_TryGetVehicleWithBiome_ReturnValue;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleSpawner_C_GeneratePreviewMesh) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_GeneratePreviewMesh");
static_assert(sizeof(BP_VehicleSpawner_C_GeneratePreviewMesh) == 0x0000D0, "Wrong size on BP_VehicleSpawner_C_GeneratePreviewMesh");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, L_SelectedVehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::L_SelectedVehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, L_BestPriority) == 0x000008, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::L_BestPriority' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000010, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000018, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, K2Node_DynamicCast_AsSQVehicle_Settings) == 0x000020, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::K2Node_DynamicCast_AsSQVehicle_Settings' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_GetDebugTeam_OutDebugTeam) == 0x000029, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_GetDebugTeam_OutDebugTeam' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_GetEditorPlaySettings_ReturnValue) == 0x000030, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_GetEditorPlaySettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetEditorSQLayer_OutEditorLayer) == 0x000038, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetEditorSQLayer_OutEditorLayer' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetEditorSQLayer_ReturnValue) == 0x000040, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetEditorSQLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetEditorFactionSetup_OutFactionSetup) == 0x000048, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetEditorFactionSetup_OutFactionSetup' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetEditorFactionSetup_ReturnValue) == 0x000050, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetEditorFactionSetup_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, K2Node_DynamicCast_AsBP_SQVehicle_Settings) == 0x000058, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::K2Node_DynamicCast_AsBP_SQVehicle_Settings' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetVehicleWithLayer_OutVehicle) == 0x000068, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetVehicleWithLayer_OutVehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetVehicleWithLayer_ReturnValue) == 0x000090, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetVehicleWithLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_Editor_GetVehicleToSpawn_Out_Has_Something_To_Spawn) == 0x000091, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_Editor_GetVehicleToSpawn_Out_Has_Something_To_Spawn' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_Editor_GetVehicleToSpawn_Out_Selected_Vehicle) == 0x000098, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_Editor_GetVehicleToSpawn_Out_Selected_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetVehicleWithBiome_OutVehicle) == 0x0000A0, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetVehicleWithBiome_OutVehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_TryGetVehicleWithBiome_ReturnValue) == 0x0000C8, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_TryGetVehicleWithBiome_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GeneratePreviewMesh, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0000C9, "Member 'BP_VehicleSpawner_C_GeneratePreviewMesh::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.GenerateReservedAreaDisplay
// 0x0130 (0x0130 - 0x0000)
struct BP_VehicleSpawner_C_GenerateReservedAreaDisplay final
{
public:
	bool                                          Reset;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B12[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B13[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B14[0xB];                                     // 0x0045(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDebugPosition_OutPosition;             // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConfigurationValid_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComputeSpawnPosition_ReturnValue;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B15[0x2];                                     // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSpawnerBound_OutBounds;                // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpawnerOverlapped_ReturnValue;          // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B16[0x3];                                     // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_VehicleSpawner_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x00F8(0x0010)(ReferenceParm)
	class ABP_VehicleSpawner_C*                   CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay) == 0x000010, "Wrong alignment on BP_VehicleSpawner_C_GenerateReservedAreaDisplay");
static_assert(sizeof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay) == 0x000130, "Wrong size on BP_VehicleSpawner_C_GenerateReservedAreaDisplay");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Reset) == 0x000000, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Reset' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_struct_Variable) == 0x000004, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_struct_Variable_1) == 0x000014, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_bool_Variable) == 0x000024, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_struct_Variable_2) == 0x000028, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, Temp_bool_Variable_1) == 0x000044, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_GetDebugPosition_OutPosition) == 0x000050, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_GetDebugPosition_OutPosition' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_BreakTransform_Location) == 0x00008C, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_BreakTransform_Scale) == 0x0000A4, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000BC, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_IsConfigurationValid_ReturnValue) == 0x0000C8, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_IsConfigurationValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_ComputeSpawnPosition_ReturnValue) == 0x0000C9, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_ComputeSpawnPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_GetSpawnerBound_OutBounds) == 0x0000CC, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_GetSpawnerBound_OutBounds' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000D8, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, K2Node_Select_Default) == 0x0000E4, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_IsSpawnerOverlapped_ReturnValue) == 0x0000F4, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_IsSpawnerOverlapped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000F8, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Array_Get_Item) == 0x000108, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, K2Node_Select_Default_1) == 0x000110, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GenerateReservedAreaDisplay, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'BP_VehicleSpawner_C_GenerateReservedAreaDisplay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetVehicleDamage
// 0x0010 (0x0010 - 0x0000)
struct BP_VehicleSpawner_C_SetVehicleDamage final
{
public:
	class ASQVehicle*                             In_Vehicle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_SetVehicleDamage) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetVehicleDamage");
static_assert(sizeof(BP_VehicleSpawner_C_SetVehicleDamage) == 0x000010, "Wrong size on BP_VehicleSpawner_C_SetVehicleDamage");
static_assert(offsetof(BP_VehicleSpawner_C_SetVehicleDamage, In_Vehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_SetVehicleDamage::In_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetVehicleDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'BP_VehicleSpawner_C_SetVehicleDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetEngineDamage
// 0x0018 (0x0018 - 0x0000)
struct BP_VehicleSpawner_C_SetEngineDamage final
{
public:
	class ASQVehicle*                             In_Vehicle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQVehicleComponent*                    CallFunc_GetVehicleEngine_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaximumHealth_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_SetEngineDamage) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetEngineDamage");
static_assert(sizeof(BP_VehicleSpawner_C_SetEngineDamage) == 0x000018, "Wrong size on BP_VehicleSpawner_C_SetEngineDamage");
static_assert(offsetof(BP_VehicleSpawner_C_SetEngineDamage, In_Vehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_SetEngineDamage::In_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetEngineDamage, CallFunc_GetVehicleEngine_ReturnValue) == 0x000008, "Member 'BP_VehicleSpawner_C_SetEngineDamage::CallFunc_GetVehicleEngine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetEngineDamage, CallFunc_GetMaximumHealth_ReturnValue) == 0x000010, "Member 'BP_VehicleSpawner_C_SetEngineDamage::CallFunc_GetMaximumHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetEngineDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_VehicleSpawner_C_SetEngineDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetPropulsionDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_VehicleSpawner_C_SetPropulsionDamage final
{
public:
	class ASQVehicle*                             In_Vehicle;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USQVehicleComponent*>            Components;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          CallFunc_SetComponentsHealthByType_Success;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetComponentsHealthByType_Success_1;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetComponentsHealthByType_Success_2;      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleSpawner_C_SetPropulsionDamage) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetPropulsionDamage");
static_assert(sizeof(BP_VehicleSpawner_C_SetPropulsionDamage) == 0x000020, "Wrong size on BP_VehicleSpawner_C_SetPropulsionDamage");
static_assert(offsetof(BP_VehicleSpawner_C_SetPropulsionDamage, In_Vehicle) == 0x000000, "Member 'BP_VehicleSpawner_C_SetPropulsionDamage::In_Vehicle' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetPropulsionDamage, Components) == 0x000008, "Member 'BP_VehicleSpawner_C_SetPropulsionDamage::Components' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetPropulsionDamage, CallFunc_SetComponentsHealthByType_Success) == 0x000018, "Member 'BP_VehicleSpawner_C_SetPropulsionDamage::CallFunc_SetComponentsHealthByType_Success' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetPropulsionDamage, CallFunc_SetComponentsHealthByType_Success_1) == 0x000019, "Member 'BP_VehicleSpawner_C_SetPropulsionDamage::CallFunc_SetComponentsHealthByType_Success_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetPropulsionDamage, CallFunc_SetComponentsHealthByType_Success_2) == 0x00001A, "Member 'BP_VehicleSpawner_C_SetPropulsionDamage::CallFunc_SetComponentsHealthByType_Success_2' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetComponentsArrayHealth
// 0x00A0 (0x00A0 - 0x0000)
struct BP_VehicleSpawner_C_SetComponentsArrayHealth final
{
public:
	TArray<class USQVehicleComponent*>            Components;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Param_NeverDestroyComponents;                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B17[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewHealthFrac;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalHealth;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B18[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B19[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVehicleComponent*                    CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaximumHealth_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1A[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVehicleComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQVehicleComponent*                    CallFunc_Array_Get_Item_2;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaximumHealth_ReturnValue_1;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaximumHealth_ReturnValue_2;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1B[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1C[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleSpawner_C_SetComponentsArrayHealth) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetComponentsArrayHealth");
static_assert(sizeof(BP_VehicleSpawner_C_SetComponentsArrayHealth) == 0x0000A0, "Wrong size on BP_VehicleSpawner_C_SetComponentsArrayHealth");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Components) == 0x000000, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Components' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Param_NeverDestroyComponents) == 0x000010, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Param_NeverDestroyComponents' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, NewHealthFrac) == 0x000014, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::NewHealthFrac' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, TotalHealth) == 0x000018, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::TotalHealth' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Not_PreBool_ReturnValue) == 0x00002D, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Array_Index_Variable_2) == 0x000038, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_GetMaximumHealth_ReturnValue) == 0x00004C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_GetMaximumHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Get_Item_2) == 0x000068, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_GetMaximumHealth_ReturnValue_1) == 0x000070, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_GetMaximumHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_GetMaximumHealth_ReturnValue_2) == 0x000074, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_GetMaximumHealth_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000078, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Length_ReturnValue_1) == 0x000080, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Array_Length_ReturnValue_2) == 0x000084, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Less_IntInt_ReturnValue_1) == 0x000089, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, Temp_int_Loop_Counter_Variable_2) == 0x00008C, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Less_IntInt_ReturnValue_2) == 0x000090, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_Add_IntInt_ReturnValue_2) == 0x000094, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsArrayHealth, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'BP_VehicleSpawner_C_SetComponentsArrayHealth::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetComponentsHealthByType
// 0x0030 (0x0030 - 0x0000)
struct BP_VehicleSpawner_C_SetComponentsHealthByType final
{
public:
	class ASQVehicle*                             VehicleTarget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ClassToChangeHealth;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FractionHealth;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1D[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USQVehicleComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleSpawner_C_SetComponentsHealthByType) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetComponentsHealthByType");
static_assert(sizeof(BP_VehicleSpawner_C_SetComponentsHealthByType) == 0x000030, "Wrong size on BP_VehicleSpawner_C_SetComponentsHealthByType");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, VehicleTarget) == 0x000000, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::VehicleTarget' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, ClassToChangeHealth) == 0x000008, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::ClassToChangeHealth' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, FractionHealth) == 0x000010, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::FractionHealth' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, Success) == 0x000014, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::Success' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000015, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetComponentsHealthByType, CallFunc_Conv_IntToBool_ReturnValue) == 0x00002C, "Member 'BP_VehicleSpawner_C_SetComponentsHealthByType::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.SetWeaponInitialAmmo
// 0x0028 (0x0028 - 0x0000)
struct BP_VehicleSpawner_C_SetWeaponInitialAmmo final
{
public:
	class ASQVehicle*                             InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSQMagazineData>                TempMagsArray;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class ASQVehicleSeat*>                 Seats;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
static_assert(alignof(BP_VehicleSpawner_C_SetWeaponInitialAmmo) == 0x000008, "Wrong alignment on BP_VehicleSpawner_C_SetWeaponInitialAmmo");
static_assert(sizeof(BP_VehicleSpawner_C_SetWeaponInitialAmmo) == 0x000028, "Wrong size on BP_VehicleSpawner_C_SetWeaponInitialAmmo");
static_assert(offsetof(BP_VehicleSpawner_C_SetWeaponInitialAmmo, InputPin) == 0x000000, "Member 'BP_VehicleSpawner_C_SetWeaponInitialAmmo::InputPin' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetWeaponInitialAmmo, TempMagsArray) == 0x000008, "Member 'BP_VehicleSpawner_C_SetWeaponInitialAmmo::TempMagsArray' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_SetWeaponInitialAmmo, Seats) == 0x000018, "Member 'BP_VehicleSpawner_C_SetWeaponInitialAmmo::Seats' has a wrong offset!");

// Function BP_VehicleSpawner.BP_VehicleSpawner_C.GetDebugTeam
// 0x0005 (0x0005 - 0x0000)
struct BP_VehicleSpawner_C_GetDebugTeam final
{
public:
	ESQTeam                                       OutDebugTeam;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTeam                                       CallFunc_GetTeam_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTeam                                       K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VehicleSpawner_C_GetDebugTeam) == 0x000001, "Wrong alignment on BP_VehicleSpawner_C_GetDebugTeam");
static_assert(sizeof(BP_VehicleSpawner_C_GetDebugTeam) == 0x000005, "Wrong size on BP_VehicleSpawner_C_GetDebugTeam");
static_assert(offsetof(BP_VehicleSpawner_C_GetDebugTeam, OutDebugTeam) == 0x000000, "Member 'BP_VehicleSpawner_C_GetDebugTeam::OutDebugTeam' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GetDebugTeam, Temp_bool_Variable) == 0x000001, "Member 'BP_VehicleSpawner_C_GetDebugTeam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_VehicleSpawner_C_GetDebugTeam, CallFunc_GetTeam_ReturnValue) == 0x000002, "Member 'BP_VehicleSpawner_C_GetDebugTeam::CallFunc_GetTeam_ReturnValue' has a wrong offset!");
