#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteelSeriesGameSense

#include "Basic.hpp"

#include "SteelSeriesGameSense_structs.hpp"


namespace SDK::Params
{

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.BindEvent
// 0x0040 (0x0040 - 0x0000)
struct SSGS_ClientBPLibrary_BindEvent final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinValue;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxValue;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESSGS_EventIconId                             IconId;                                            // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17EC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USSGS_HandlerCollection*                Handlers;                                          // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ValueOptional;                                     // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17ED[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SSGS_ClientBPLibrary_BindEvent) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_BindEvent");
static_assert(sizeof(SSGS_ClientBPLibrary_BindEvent) == 0x000040, "Wrong size on SSGS_ClientBPLibrary_BindEvent");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_BindEvent::GameName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, EventName) == 0x000010, "Member 'SSGS_ClientBPLibrary_BindEvent::EventName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, MinValue) == 0x000020, "Member 'SSGS_ClientBPLibrary_BindEvent::MinValue' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, MaxValue) == 0x000024, "Member 'SSGS_ClientBPLibrary_BindEvent::MaxValue' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, IconId) == 0x000028, "Member 'SSGS_ClientBPLibrary_BindEvent::IconId' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, Handlers) == 0x000030, "Member 'SSGS_ClientBPLibrary_BindEvent::Handlers' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_BindEvent, ValueOptional) == 0x000038, "Member 'SSGS_ClientBPLibrary_BindEvent::ValueOptional' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.RegisterEvent
// 0x0030 (0x0030 - 0x0000)
struct SSGS_ClientBPLibrary_RegisterEvent final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinValue;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxValue;                                          // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESSGS_EventIconId                             IconId;                                            // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ValueOptional;                                     // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17EE[0x6];                                     // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SSGS_ClientBPLibrary_RegisterEvent) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_RegisterEvent");
static_assert(sizeof(SSGS_ClientBPLibrary_RegisterEvent) == 0x000030, "Wrong size on SSGS_ClientBPLibrary_RegisterEvent");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_RegisterEvent::GameName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, EventName) == 0x000010, "Member 'SSGS_ClientBPLibrary_RegisterEvent::EventName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, MinValue) == 0x000020, "Member 'SSGS_ClientBPLibrary_RegisterEvent::MinValue' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, MaxValue) == 0x000024, "Member 'SSGS_ClientBPLibrary_RegisterEvent::MaxValue' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, IconId) == 0x000028, "Member 'SSGS_ClientBPLibrary_RegisterEvent::IconId' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterEvent, ValueOptional) == 0x000029, "Member 'SSGS_ClientBPLibrary_RegisterEvent::ValueOptional' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.RegisterGame
// 0x0030 (0x0030 - 0x0000)
struct SSGS_ClientBPLibrary_RegisterGame final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameDisplayName;                                   // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Developer;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ClientBPLibrary_RegisterGame) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_RegisterGame");
static_assert(sizeof(SSGS_ClientBPLibrary_RegisterGame) == 0x000030, "Wrong size on SSGS_ClientBPLibrary_RegisterGame");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterGame, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_RegisterGame::GameName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterGame, GameDisplayName) == 0x000010, "Member 'SSGS_ClientBPLibrary_RegisterGame::GameDisplayName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RegisterGame, Developer) == 0x000020, "Member 'SSGS_ClientBPLibrary_RegisterGame::Developer' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.RemoveEvent
// 0x0020 (0x0020 - 0x0000)
struct SSGS_ClientBPLibrary_RemoveEvent final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ClientBPLibrary_RemoveEvent) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_RemoveEvent");
static_assert(sizeof(SSGS_ClientBPLibrary_RemoveEvent) == 0x000020, "Wrong size on SSGS_ClientBPLibrary_RemoveEvent");
static_assert(offsetof(SSGS_ClientBPLibrary_RemoveEvent, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_RemoveEvent::GameName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_RemoveEvent, EventName) == 0x000010, "Member 'SSGS_ClientBPLibrary_RemoveEvent::EventName' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.RemoveGame
// 0x0010 (0x0010 - 0x0000)
struct SSGS_ClientBPLibrary_RemoveGame final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ClientBPLibrary_RemoveGame) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_RemoveGame");
static_assert(sizeof(SSGS_ClientBPLibrary_RemoveGame) == 0x000010, "Wrong size on SSGS_ClientBPLibrary_RemoveGame");
static_assert(offsetof(SSGS_ClientBPLibrary_RemoveGame, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_RemoveGame::GameName' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.SendEvent
// 0x0038 (0x0038 - 0x0000)
struct SSGS_ClientBPLibrary_SendEvent final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSSGS_EventData                        Data;                                              // 0x0020(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ClientBPLibrary_SendEvent) == 0x000008, "Wrong alignment on SSGS_ClientBPLibrary_SendEvent");
static_assert(sizeof(SSGS_ClientBPLibrary_SendEvent) == 0x000038, "Wrong size on SSGS_ClientBPLibrary_SendEvent");
static_assert(offsetof(SSGS_ClientBPLibrary_SendEvent, GameName) == 0x000000, "Member 'SSGS_ClientBPLibrary_SendEvent::GameName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_SendEvent, EventName) == 0x000010, "Member 'SSGS_ClientBPLibrary_SendEvent::EventName' has a wrong offset!");
static_assert(offsetof(SSGS_ClientBPLibrary_SendEvent, Data) == 0x000020, "Member 'SSGS_ClientBPLibrary_SendEvent::Data' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ClientBPLibrary.Start
// 0x0001 (0x0001 - 0x0000)
struct SSGS_ClientBPLibrary_Start final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ClientBPLibrary_Start) == 0x000001, "Wrong alignment on SSGS_ClientBPLibrary_Start");
static_assert(sizeof(SSGS_ClientBPLibrary_Start) == 0x000001, "Wrong size on SSGS_ClientBPLibrary_Start");
static_assert(offsetof(SSGS_ClientBPLibrary_Start, ReturnValue) == 0x000000, "Member 'SSGS_ClientBPLibrary_Start::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ColorEffectSpecificationGradient.MakeGradientColorEffect
// 0x0010 (0x0010 - 0x0000)
struct SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect final
{
public:
	struct FSSGS_RGB                              Zero;                                              // 0x0000(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSSGS_RGB                              Hundred;                                           // 0x0003(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17F1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USSGS_ColorEffectSpecificationGradient* ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect) == 0x000008, "Wrong alignment on SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect");
static_assert(sizeof(SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect) == 0x000010, "Wrong size on SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect");
static_assert(offsetof(SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect, Zero) == 0x000000, "Member 'SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect::Zero' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect, Hundred) == 0x000003, "Member 'SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect::Hundred' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect, ReturnValue) == 0x000008, "Member 'SSGS_ColorEffectSpecificationGradient_MakeGradientColorEffect::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ColorEffectSpecificationRanges.MakeGradientColorRange
// 0x0030 (0x0030 - 0x0000)
struct SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange final
{
public:
	int32                                         Low;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         High;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSSGS_RGB                              Zero;                                              // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FSSGS_RGB                              Hundred;                                           // 0x000B(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17F2[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSGS_ColorRange                       ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange) == 0x000008, "Wrong alignment on SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange");
static_assert(sizeof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange) == 0x000030, "Wrong size on SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange, Low) == 0x000000, "Member 'SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange::Low' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange, High) == 0x000004, "Member 'SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange::High' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange, Zero) == 0x000008, "Member 'SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange::Zero' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange, Hundred) == 0x00000B, "Member 'SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange::Hundred' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange, ReturnValue) == 0x000010, "Member 'SSGS_ColorEffectSpecificationRanges_MakeGradientColorRange::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ColorEffectSpecificationRanges.MakeRangeColorEffect
// 0x0018 (0x0018 - 0x0000)
struct SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect final
{
public:
	TArray<struct FSSGS_ColorRange>               V;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USSGS_ColorEffectSpecificationRanges*   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect) == 0x000008, "Wrong alignment on SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect");
static_assert(sizeof(SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect) == 0x000018, "Wrong size on SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect, V) == 0x000000, "Member 'SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect::V' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect, ReturnValue) == 0x000010, "Member 'SSGS_ColorEffectSpecificationRanges_MakeRangeColorEffect::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ColorEffectSpecificationRanges.MakeStaticColorRange
// 0x0030 (0x0030 - 0x0000)
struct SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange final
{
public:
	int32                                         Low;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         High;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSSGS_RGB                              Color;                                             // 0x0008(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17F3[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSGS_ColorRange                       ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange) == 0x000008, "Wrong alignment on SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange");
static_assert(sizeof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange) == 0x000030, "Wrong size on SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange, Low) == 0x000000, "Member 'SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange::Low' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange, High) == 0x000004, "Member 'SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange::High' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange, Color) == 0x000008, "Member 'SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange::Color' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange, ReturnValue) == 0x000010, "Member 'SSGS_ColorEffectSpecificationRanges_MakeStaticColorRange::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ColorEffectSpecificationStatic.MakeStaticColorEffect
// 0x0010 (0x0010 - 0x0000)
struct SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect final
{
public:
	struct FSSGS_RGB                              Param_Color;                                       // 0x0000(0x0003)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17F5[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USSGS_ColorEffectSpecificationStatic*   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect) == 0x000008, "Wrong alignment on SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect");
static_assert(sizeof(SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect) == 0x000010, "Wrong size on SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect");
static_assert(offsetof(SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect, Param_Color) == 0x000000, "Member 'SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect::Param_Color' has a wrong offset!");
static_assert(offsetof(SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect, ReturnValue) == 0x000008, "Member 'SSGS_ColorEffectSpecificationStatic_MakeStaticColorEffect::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_headset_earcups
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_headset_earcups::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_indicator_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_indicator_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_indicator_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_indicator_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_indicator_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_indicator_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_indicator_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_indicator_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_keyboad_function_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_keyboad_function_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_keyboad_keypad
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_keyboad_keypad::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_keyboad_macro_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_keyboad_macro_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_keyboad_main_keyboard
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_keyboad_main_keyboard::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_keyboad_number_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_keyboad_number_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_mouse_logo
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_mouse_logo::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_mouse_wheel
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_mouse_wheel::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb1zone_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb1zone_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb2zone_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb2zone_two
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb2zone_two::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb3zone_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb3zone_three
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_three::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb3zone_two
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb3zone_two::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb4zone_four
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_four::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb4zone_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb4zone_three
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_three::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb4zone_two
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb4zone_two::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb5zone_five
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_five::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb5zone_four
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_four::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb5zone_one
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb5zone_three
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_three::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgb5zone_two
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgb5zone_two::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_a_row
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_a_row::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_all
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_all::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_arrows
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_arrows::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_custom
// 0x0048 (0x0048 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom final
{
public:
	TArray<uint8>                                 V;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0010(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom) == 0x000048, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom, V) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom::V' has a wrong offset!");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom, ReturnValue) == 0x000010, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_custom::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_function_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_function_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_keypad
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_keypad_nums
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_keypad_nums::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_macro_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_macro_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_main_keyboard
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_main_keyboard::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_nav_cluster
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_nav_cluster::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_number_keys
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_number_keys::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_q_row
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_q_row::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_IlluminationDeviceZoneFactory.make_rgbperkeyzones_z_row
// 0x0038 (0x0038 - 0x0000)
struct SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row final
{
public:
	struct FSSGS_IlluminationDeviceZone           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row) == 0x000008, "Wrong alignment on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row");
static_assert(sizeof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row) == 0x000038, "Wrong size on SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row");
static_assert(offsetof(SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row, ReturnValue) == 0x000000, "Member 'SSGS_IlluminationDeviceZoneFactory_Make_rgbperkeyzones_z_row::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_TactileDeviceZoneFactory.make_tactile_one
// 0x0020 (0x0020 - 0x0000)
struct SSGS_TactileDeviceZoneFactory_Make_tactile_one final
{
public:
	struct FSSGS_TactileDeviceZone                ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_TactileDeviceZoneFactory_Make_tactile_one) == 0x000008, "Wrong alignment on SSGS_TactileDeviceZoneFactory_Make_tactile_one");
static_assert(sizeof(SSGS_TactileDeviceZoneFactory_Make_tactile_one) == 0x000020, "Wrong size on SSGS_TactileDeviceZoneFactory_Make_tactile_one");
static_assert(offsetof(SSGS_TactileDeviceZoneFactory_Make_tactile_one, ReturnValue) == 0x000000, "Member 'SSGS_TactileDeviceZoneFactory_Make_tactile_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ScreenDeviceZoneFactory.make_screened_128x36_one
// 0x0028 (0x0028 - 0x0000)
struct SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one final
{
public:
	struct FSSGS_ScreenDeviceZone                 ReturnValue;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one) == 0x000008, "Wrong alignment on SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one");
static_assert(sizeof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one) == 0x000028, "Wrong size on SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one");
static_assert(offsetof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one, ReturnValue) == 0x000000, "Member 'SSGS_ScreenDeviceZoneFactory_Make_screened_128x36_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ScreenDeviceZoneFactory.make_screened_128x40_one
// 0x0028 (0x0028 - 0x0000)
struct SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one final
{
public:
	struct FSSGS_ScreenDeviceZone                 ReturnValue;                                       // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one) == 0x000008, "Wrong alignment on SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one");
static_assert(sizeof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one) == 0x000028, "Wrong size on SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one");
static_assert(offsetof(SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one, ReturnValue) == 0x000000, "Member 'SSGS_ScreenDeviceZoneFactory_Make_screened_128x40_one::ReturnValue' has a wrong offset!");

// Function SteelSeriesGameSense.SSGS_ScreenDeviceZoneFactory.make_screened_128x48_one
// 0x0028 (0x0028 - 0x0000)
struct SSGS_ScreenDeviceZoneFactory_Make_screened_128x48_one final
{
public:
