#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_VoteScreen

#include "Basic.hpp"

#include "Squad_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SQFactionSetupEntry_structs.hpp"
#include "SQLevelEntry_structs.hpp"
#include "Engine_structs.hpp"
#include "SQFactionEntry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ESQVoteType_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_VoteScreen.UMG_VoteScreen_C.ExecuteUbergraph_UMG_VoteScreen
// 0x0268 (0x0268 - 0x0000)
struct UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33EA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_HUD_C>            K2Node_DynamicCast_AsBPI_HUD;                      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EC[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQScoreboard*                          CallFunc_Get_Scoreboard_Scoreboard;                // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Scoreboard_C*                      K2Node_DynamicCast_AsUMG_Scoreboard;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTimedOut_ReturnValue;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33ED[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ChoiceID;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EE[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQVoteSessionClient*                   K2Node_Event_VoteSession_2;                        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_VotePossible;                         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33EF[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVoteSessionClient*                   K2Node_Event_VoteSession_1;                        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PlayerCurrentVoteCount;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESQVoteType                                   CallFunc_GetVoteType_OutVoteType;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRegenerationChoicePossible_ReturnValue; // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F0[0x2];                                     // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VoteScreen_C>     CallFunc_UpdateActivations_ActivatedScreen;        // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQVoteType                                   CallFunc_GetVoteType_OutVoteType_1;                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F1[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVoteSessionClient*                   K2Node_Event_VoteSession;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQChoice                              K2Node_Event_Winner;                               // 0x0108(0x0018)(NoDestructor)
	ESQVoteType                                   CallFunc_GetVoteType_OutVoteType_2;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F2[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VoteScreen_C>     CallFunc_UpdateActivations_ActivatedScreen_1;      // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Activated;                            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F3[0x6];                                     // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F4[0x4];                                     // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F5[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VoteScreen_C>     CallFunc_UpdateActivations_ActivatedScreen_2;      // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0176(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_ComponentBoundEvent_VoteID;                 // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33F6[0x7];                                     // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSelected_1;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F7[0x7];                                     // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HUD_C>            K2Node_DynamicCast_AsBPI_HUD_1;                    // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F8[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQScoreboard*                          CallFunc_Get_Scoreboard_Scoreboard_1;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName LayerID)>          K2Node_CreateDelegate_OutputDelegate;              // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class UUMG_Scoreboard_C*                      K2Node_DynamicCast_AsUMG_Scoreboard_1;             // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33F9[0x2];                                     // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName Faction)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_33FA[0x4];                                     // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33FB[0x1];                                     // 0x020B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_ChoiceId;               // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33FC[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value_1;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bSelected;              // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33FD[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     K2Node_ComponentBoundEvent_Button;                 // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33FE[0x7];                                     // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33FF[0x7];                                     // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQPlayerController*                    K2Node_DynamicCast_AsSQPlayer_Controller;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3400[0x7];                                     // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Scoreboard_C*                      CallFunc_GetScoreboardRef_Scoreboard;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3401[0x2];                                     // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen");
static_assert(sizeof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen) == 0x000268, "Wrong size on UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, EntryPoint) == 0x000000, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000018, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetHUD_ReturnValue) == 0x000030, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_bool_Variable) == 0x000038, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_AsBPI_HUD) == 0x000040, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_AsBPI_HUD' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_CustomEvent_Index) == 0x000054, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_Get_Scoreboard_Scoreboard) == 0x000058, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_Get_Scoreboard_Scoreboard' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_AsUMG_Scoreboard) == 0x000060, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_AsUMG_Scoreboard' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_HasTimedOut_ReturnValue) == 0x00006A, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_HasTimedOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000070, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000078, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_ChoiceID) == 0x000080, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_ChoiceID' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_Array_Contains_ReturnValue) == 0x000088, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_MyGeometry) == 0x00008C, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_VoteSession_2) == 0x0000C8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_VoteSession_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_VotePossible) == 0x0000D0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_VotePossible' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_VoteSession_1) == 0x0000D8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_VoteSession_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_PlayerCurrentVoteCount) == 0x0000E0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_PlayerCurrentVoteCount' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetVoteType_OutVoteType) == 0x0000E4, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetVoteType_OutVoteType' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsRegenerationChoicePossible_ReturnValue) == 0x0000E5, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsRegenerationChoicePossible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_UpdateActivations_ActivatedScreen) == 0x0000E8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_UpdateActivations_ActivatedScreen' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetVoteType_OutVoteType_1) == 0x0000F8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetVoteType_OutVoteType_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_VoteSession) == 0x000100, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_VoteSession' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_Winner) == 0x000108, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_Winner' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetVoteType_OutVoteType_2) == 0x000120, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetVoteType_OutVoteType_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_UpdateActivations_ActivatedScreen_1) == 0x000128, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_UpdateActivations_ActivatedScreen_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Event_Activated) == 0x000138, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Event_Activated' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000139, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000140, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetEndTime_ReturnValue_1) == 0x000148, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetEndTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000150, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable) == 0x000158, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_UpdateActivations_ActivatedScreen_2) == 0x000160, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_UpdateActivations_ActivatedScreen_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable_1) == 0x000170, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsVisible_ReturnValue) == 0x000171, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsVisible_ReturnValue_1) == 0x000172, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsVisible_ReturnValue_2) == 0x000173, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_BooleanOR_ReturnValue) == 0x000174, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_BooleanOR_ReturnValue_1) == 0x000175, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000176, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_bool_Variable_1) == 0x000177, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_VoteID) == 0x000178, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_VoteID' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable_2) == 0x000180, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_K2_SetTimer_ReturnValue) == 0x000188, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_bSelected_1) == 0x000190, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_bSelected_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000198, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetPlayerController_ReturnValue_1) == 0x0001A0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetHUD_ReturnValue_1) == 0x0001A8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_AsBPI_HUD_1) == 0x0001B0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_AsBPI_HUD_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_Get_Scoreboard_Scoreboard_1) == 0x0001C8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_Get_Scoreboard_Scoreboard_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0001D0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_AsUMG_Scoreboard_1) == 0x0001E0, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_AsUMG_Scoreboard_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_bSuccess_3) == 0x0001E8, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_IsValid_ReturnValue_2) == 0x0001E9, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001EC, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetSquadGameState_Return_Value) == 0x000200, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetSquadGameState_Return_Value' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_BooleanAND_ReturnValue) == 0x000208, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable_3) == 0x000209, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Select_Default) == 0x00020A, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_ChoiceId) == 0x00020C, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_ChoiceId' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetSquadGameState_Return_Value_1) == 0x000218, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetSquadGameState_Return_Value_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_bool_Variable_2) == 0x000220, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_bSelected) == 0x000221, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_bSelected' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_ComponentBoundEvent_Button) == 0x000228, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Select_Default_1) == 0x000230, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000238, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable_4) == 0x000240, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_AsSQPlayer_Controller) == 0x000248, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_AsSQPlayer_Controller' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_DynamicCast_bSuccess_4) == 0x000250, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_GetScoreboardRef_Scoreboard) == 0x000258, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_GetScoreboardRef_Scoreboard' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, Temp_byte_Variable_5) == 0x000260, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, K2Node_Select_Default_2) == 0x000261, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen, CallFunc_SelectInt_ReturnValue) == 0x000264, "Member 'UMG_VoteScreen_C_ExecuteUbergraph_UMG_VoteScreen::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3402[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000010, "Wrong size on UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'UMG_VoteScreen_C_BndEvt__MainMenu_Button_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature final
{
public:
	class FName                                   ChoiceId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature");
static_assert(sizeof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature) == 0x000008, "Wrong size on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature, ChoiceId) == 0x000000, "Member 'UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ResultItem_K2Node_ComponentBoundEvent_6_InfoSelected__DelegateSignature::ChoiceId' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3403[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000010, "Wrong size on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_ButtonSERVERBROWSERN_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature final
{
public:
	class FName                                   VoteId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature");
static_assert(sizeof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature) == 0x000008, "Wrong size on UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature");
static_assert(offsetof(UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature, VoteId) == 0x000000, "Member 'UMG_VoteScreen_C_BndEvt__UMG_VoteScreen_VoteNone_K2Node_ComponentBoundEvent_0_VoteSelected__DelegateSignature::VoteId' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.SetVoteScreenActive
// 0x0001 (0x0001 - 0x0000)
struct UMG_VoteScreen_C_SetVoteScreenActive final
{
public:
	bool                                          Activated;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_VoteScreen_C_SetVoteScreenActive) == 0x000001, "Wrong alignment on UMG_VoteScreen_C_SetVoteScreenActive");
static_assert(sizeof(UMG_VoteScreen_C_SetVoteScreenActive) == 0x000001, "Wrong size on UMG_VoteScreen_C_SetVoteScreenActive");
static_assert(offsetof(UMG_VoteScreen_C_SetVoteScreenActive, Activated) == 0x000000, "Member 'UMG_VoteScreen_C_SetVoteScreenActive::Activated' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.OnVoteEnded
// 0x0020 (0x0020 - 0x0000)
struct UMG_VoteScreen_C_OnVoteEnded final
{
public:
	class USQVoteSessionClient*                   VoteSession;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQChoice                              Winner;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UMG_VoteScreen_C_OnVoteEnded) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_OnVoteEnded");
static_assert(sizeof(UMG_VoteScreen_C_OnVoteEnded) == 0x000020, "Wrong size on UMG_VoteScreen_C_OnVoteEnded");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteEnded, VoteSession) == 0x000000, "Member 'UMG_VoteScreen_C_OnVoteEnded::VoteSession' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteEnded, Winner) == 0x000008, "Member 'UMG_VoteScreen_C_OnVoteEnded::Winner' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.OnVoteUpdated
// 0x0010 (0x0010 - 0x0000)
struct UMG_VoteScreen_C_OnVoteUpdated final
{
public:
	class USQVoteSessionClient*                   VoteSession;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerCurrentVoteCount;                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_OnVoteUpdated) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_OnVoteUpdated");
static_assert(sizeof(UMG_VoteScreen_C_OnVoteUpdated) == 0x000010, "Wrong size on UMG_VoteScreen_C_OnVoteUpdated");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteUpdated, VoteSession) == 0x000000, "Member 'UMG_VoteScreen_C_OnVoteUpdated::VoteSession' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteUpdated, PlayerCurrentVoteCount) == 0x000008, "Member 'UMG_VoteScreen_C_OnVoteUpdated::PlayerCurrentVoteCount' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.OnVoteStarted
// 0x0010 (0x0010 - 0x0000)
struct UMG_VoteScreen_C_OnVoteStarted final
{
public:
	class USQVoteSessionClient*                   VoteSession;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VotePossible;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_VoteScreen_C_OnVoteStarted) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_OnVoteStarted");
static_assert(sizeof(UMG_VoteScreen_C_OnVoteStarted) == 0x000010, "Wrong size on UMG_VoteScreen_C_OnVoteStarted");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteStarted, VoteSession) == 0x000000, "Member 'UMG_VoteScreen_C_OnVoteStarted::VoteSession' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteStarted, VotePossible) == 0x000008, "Member 'UMG_VoteScreen_C_OnVoteStarted::VotePossible' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_VoteScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_Tick) == 0x000004, "Wrong alignment on UMG_VoteScreen_C_Tick");
static_assert(sizeof(UMG_VoteScreen_C_Tick) == 0x00003C, "Wrong size on UMG_VoteScreen_C_Tick");
static_assert(offsetof(UMG_VoteScreen_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_VoteScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_VoteScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.OnVoteUpdatedByID
// 0x0008 (0x0008 - 0x0000)
struct UMG_VoteScreen_C_OnVoteUpdatedByID final
{
public:
	class FName                                   ChoiceId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_OnVoteUpdatedByID) == 0x000004, "Wrong alignment on UMG_VoteScreen_C_OnVoteUpdatedByID");
static_assert(sizeof(UMG_VoteScreen_C_OnVoteUpdatedByID) == 0x000008, "Wrong size on UMG_VoteScreen_C_OnVoteUpdatedByID");
static_assert(offsetof(UMG_VoteScreen_C_OnVoteUpdatedByID, ChoiceId) == 0x000000, "Member 'UMG_VoteScreen_C_OnVoteUpdatedByID::ChoiceId' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.SwitchToScreen
// 0x0004 (0x0004 - 0x0000)
struct UMG_VoteScreen_C_SwitchToScreen final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_VoteScreen_C_SwitchToScreen) == 0x000004, "Wrong alignment on UMG_VoteScreen_C_SwitchToScreen");
static_assert(sizeof(UMG_VoteScreen_C_SwitchToScreen) == 0x000004, "Wrong size on UMG_VoteScreen_C_SwitchToScreen");
static_assert(offsetof(UMG_VoteScreen_C_SwitchToScreen, Param_Index) == 0x000000, "Member 'UMG_VoteScreen_C_SwitchToScreen::Param_Index' has a wrong offset!");

// Function UMG_VoteScreen.UMG_VoteScreen_C.UpdateActivations
// 0x0060 (0x0060 - 0x0000)
struct UMG_VoteScreen_C_UpdateActivations final
{
public:
	ESQVoteType                                   VoteType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3404[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VoteScreen_C>     ActivatedScreen;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IBPI_VoteScreen_C>     Result;                                            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3405[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVoteWidget_Success;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3406[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_VoteScreen_C>     CallFunc_GetVoteWidget_Widget;                     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_VoteScreen_C_UpdateActivations) == 0x000008, "Wrong alignment on UMG_VoteScreen_C_UpdateActivations");
static_assert(sizeof(UMG_VoteScreen_C_UpdateActivations) == 0x000060, "Wrong size on UMG_VoteScreen_C_UpdateActivations");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, VoteType) == 0x000000, "Member 'UMG_VoteScreen_C_UpdateActivations::VoteType' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, ActivatedScreen) == 0x000008, "Member 'UMG_VoteScreen_C_UpdateActivations::ActivatedScreen' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, Result) == 0x000018, "Member 'UMG_VoteScreen_C_UpdateActivations::Result' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, Temp_int_Variable) == 0x000028, "Member 'UMG_VoteScreen_C_UpdateActivations::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, Temp_int_Variable_1) == 0x00002C, "Member 'UMG_VoteScreen_C_UpdateActivations::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_Conv_IntToByte_ReturnValue) == 0x000030, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_GetValidValue_ReturnValue) == 0x000038, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000039, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x00003B, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00003C, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_GetVoteWidget_Success) == 0x000040, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_GetVoteWidget_Success' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_GetVoteWidget_Widget) == 0x000048, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_GetVoteWidget_Widget' has a wrong offset!");
static_assert(offsetof(UMG_VoteScreen_C_UpdateActivations, CallFunc_MakeLiteralInt_ReturnValue) == 0x000058, "Member 'UMG_VoteScreen_C_UpdateActivations::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
