#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SQMapCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_SQMapCore.W_SQMapCore_C.Mouse Down__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct W_SQMapCore_C_Mouse_Down__DelegateSignature final
{
public:
	struct FPointerEvent                          Mouse_Event;                                       // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                World_Location;                                    // 0x0070(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SQMapCore_C_Mouse_Down__DelegateSignature) == 0x000008, "Wrong alignment on W_SQMapCore_C_Mouse_Down__DelegateSignature");
static_assert(sizeof(W_SQMapCore_C_Mouse_Down__DelegateSignature) == 0x000080, "Wrong size on W_SQMapCore_C_Mouse_Down__DelegateSignature");
static_assert(offsetof(W_SQMapCore_C_Mouse_Down__DelegateSignature, Mouse_Event) == 0x000000, "Member 'W_SQMapCore_C_Mouse_Down__DelegateSignature::Mouse_Event' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Mouse_Down__DelegateSignature, World_Location) == 0x000070, "Member 'W_SQMapCore_C_Mouse_Down__DelegateSignature::World_Location' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.ExecuteUbergraph_W_SQMapCore
// 0x0128 (0x0128 - 0x0000)
struct W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48D9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0070)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x00BC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DA[0x1];                                     // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0127(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore) == 0x000008, "Wrong alignment on W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore");
static_assert(sizeof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore) == 0x000128, "Wrong size on W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, EntryPoint) == 0x000000, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, K2Node_Event_MouseEvent) == 0x000008, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, K2Node_Event_MyGeometry) == 0x000078, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x0000B4, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_GetCachedGeometry_ReturnValue) == 0x0000BC, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_MakeLiteralFloat_ReturnValue) == 0x0000F4, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_GetLocalSize_ReturnValue) == 0x0000F8, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000100, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BreakVector2D_X) == 0x000108, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BreakVector2D_Y) == 0x00010C, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BreakVector2D_X_1) == 0x000110, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BreakVector2D_Y_1) == 0x000114, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000118, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Less_FloatFloat_ReturnValue) == 0x00011C, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00011D, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00011E, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000120, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000124, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BooleanOR_ReturnValue) == 0x000125, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BooleanOR_ReturnValue_1) == 0x000126, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore, CallFunc_BooleanOR_ReturnValue_2) == 0x000127, "Member 'W_SQMapCore_C_ExecuteUbergraph_W_SQMapCore::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_SQMapCore_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SQMapCore_C_Tick) == 0x000004, "Wrong alignment on W_SQMapCore_C_Tick");
static_assert(sizeof(W_SQMapCore_C_Tick) == 0x00003C, "Wrong size on W_SQMapCore_C_Tick");
static_assert(offsetof(W_SQMapCore_C_Tick, MyGeometry) == 0x000000, "Member 'W_SQMapCore_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Tick, InDeltaTime) == 0x000038, "Member 'W_SQMapCore_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct W_SQMapCore_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_SQMapCore_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_SQMapCore_C_OnMouseLeave");
static_assert(sizeof(W_SQMapCore_C_OnMouseLeave) == 0x000070, "Wrong size on W_SQMapCore_C_OnMouseLeave");
static_assert(offsetof(W_SQMapCore_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_SQMapCore_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.Zoom
// 0x0024 (0x0024 - 0x0000)
struct W_SQMapCore_C_Zoom final
{
public:
	bool                                          Instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DB[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Amount;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUpdate;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ZoomTargetLocation;                                // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_FindZoomLocation_OutScreenLocation;       // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_Zoom) == 0x000004, "Wrong alignment on W_SQMapCore_C_Zoom");
static_assert(sizeof(W_SQMapCore_C_Zoom) == 0x000024, "Wrong size on W_SQMapCore_C_Zoom");
static_assert(offsetof(W_SQMapCore_C_Zoom, Instant) == 0x000000, "Member 'W_SQMapCore_C_Zoom::Instant' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, Amount) == 0x000004, "Member 'W_SQMapCore_C_Zoom::Amount' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, IsUpdate) == 0x000008, "Member 'W_SQMapCore_C_Zoom::IsUpdate' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, ZoomTargetLocation) == 0x00000C, "Member 'W_SQMapCore_C_Zoom::ZoomTargetLocation' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, CallFunc_FindZoomLocation_OutScreenLocation) == 0x000014, "Member 'W_SQMapCore_C_Zoom::CallFunc_FindZoomLocation_OutScreenLocation' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'W_SQMapCore_C_Zoom::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000020, "Member 'W_SQMapCore_C_Zoom::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Zoom, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'W_SQMapCore_C_Zoom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.InitialiseMapTexture
// 0x0040 (0x0040 - 0x0000)
struct W_SQMapCore_C_InitialiseMapTexture final
{
public:
	TDelegate<void(class UTexture* Texture)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DD[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWorldSettings*                         CallFunc_GetWorldSettings_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQWorldSettings*                       K2Node_DynamicCast_AsSQWorld_Settings;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_InitialiseMapTexture) == 0x000008, "Wrong alignment on W_SQMapCore_C_InitialiseMapTexture");
static_assert(sizeof(W_SQMapCore_C_InitialiseMapTexture) == 0x000040, "Wrong size on W_SQMapCore_C_InitialiseMapTexture");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_SQMapCore_C_InitialiseMapTexture::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'W_SQMapCore_C_InitialiseMapTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'W_SQMapCore_C_InitialiseMapTexture::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'W_SQMapCore_C_InitialiseMapTexture::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, CallFunc_GetWorldSettings_ReturnValue) == 0x000028, "Member 'W_SQMapCore_C_InitialiseMapTexture::CallFunc_GetWorldSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, K2Node_DynamicCast_AsSQWorld_Settings) == 0x000030, "Member 'W_SQMapCore_C_InitialiseMapTexture::K2Node_DynamicCast_AsSQWorld_Settings' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_InitialiseMapTexture, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'W_SQMapCore_C_InitialiseMapTexture::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.OnMouseButtonDown
// 0x0500 (0x0500 - 0x0000)
struct W_SQMapCore_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            Result;                                            // 0x0160(0x00B8)(Edit, BlueprintVisible)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0218(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DE[0x3];                                     // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Mouse_Position_to_World_Location_ReturnValue; // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RebaseLocalOriginOntoZero_ReturnValue;    // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Can_Place_Map_Menu_Valid;                 // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48DF[0x3];                                     // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E0[0x3];                                     // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x028D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x028E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x028F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E1[0x6];                                     // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0298(0x00B8)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0358(0x00B8)()
	TScriptInterface<class IBPI_PlayerController_C> K2Node_DynamicCast_AsBPI_Player_Controller;        // 0x0410(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_bCan_Place_Marker_Can_Place;              // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E2[0x6];                                     // 0x0422(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1; // 0x0428(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0440(0x00B8)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on W_SQMapCore_C_OnMouseButtonDown");
static_assert(sizeof(W_SQMapCore_C_OnMouseButtonDown) == 0x000500, "Wrong size on W_SQMapCore_C_OnMouseButtonDown");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'W_SQMapCore_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'W_SQMapCore_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'W_SQMapCore_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, Result) == 0x000160, "Member 'W_SQMapCore_C_OnMouseButtonDown::Result' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000218, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000230, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000234, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Mouse_Position_to_World_Location_ReturnValue) == 0x00023C, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Mouse_Position_to_World_Location_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_RebaseLocalOriginOntoZero_ReturnValue) == 0x000248, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_RebaseLocalOriginOntoZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Can_Place_Map_Menu_Valid) == 0x000254, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Can_Place_Map_Menu_Valid' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1) == 0x000258, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000260, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_GetLocalSize_ReturnValue) == 0x000268, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BreakVector2D_X) == 0x000270, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BreakVector2D_Y) == 0x000274, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BreakVector2D_X_1) == 0x000278, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BreakVector2D_Y_1) == 0x00027C, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Less_FloatFloat_ReturnValue) == 0x000280, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000284, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000288, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00028C, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00028D, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00028E, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BooleanOR_ReturnValue) == 0x00028F, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BooleanOR_ReturnValue_1) == 0x000290, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_BooleanOR_ReturnValue_2) == 0x000291, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000298, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_GetOwningPlayer_ReturnValue) == 0x000350, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue_1) == 0x000358, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, K2Node_DynamicCast_AsBPI_Player_Controller) == 0x000410, "Member 'W_SQMapCore_C_OnMouseButtonDown::K2Node_DynamicCast_AsBPI_Player_Controller' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000420, "Member 'W_SQMapCore_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_bCan_Place_Marker_Can_Place) == 0x000421, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_bCan_Place_Marker_Can_Place' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1) == 0x000428, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000440, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x0004F8, "Member 'W_SQMapCore_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.Hide SL Menu
// 0x00D0 (0x00D0 - 0x0000)
struct W_SQMapCore_C_Hide_SL_Menu final
{
public:
	bool                                          New_Visible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              Visible_Geometry;                                  // 0x0004(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E4[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          Mouse_Event;                                       // 0x0040(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E5[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQPlayerController*                    K2Node_DynamicCast_AsSQPlayer_Controller;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSquadLeader_ReturnValue;                // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_Hide_SL_Menu) == 0x000008, "Wrong alignment on W_SQMapCore_C_Hide_SL_Menu");
static_assert(sizeof(W_SQMapCore_C_Hide_SL_Menu) == 0x0000D0, "Wrong size on W_SQMapCore_C_Hide_SL_Menu");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, New_Visible) == 0x000000, "Member 'W_SQMapCore_C_Hide_SL_Menu::New_Visible' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, Visible_Geometry) == 0x000004, "Member 'W_SQMapCore_C_Hide_SL_Menu::Visible_Geometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, Mouse_Event) == 0x000040, "Member 'W_SQMapCore_C_Hide_SL_Menu::Mouse_Event' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'W_SQMapCore_C_Hide_SL_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'W_SQMapCore_C_Hide_SL_Menu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, K2Node_DynamicCast_AsSQPlayer_Controller) == 0x0000C0, "Member 'W_SQMapCore_C_Hide_SL_Menu::K2Node_DynamicCast_AsSQPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'W_SQMapCore_C_Hide_SL_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, CallFunc_IsValid_ReturnValue_1) == 0x0000C9, "Member 'W_SQMapCore_C_Hide_SL_Menu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Hide_SL_Menu, CallFunc_IsSquadLeader_ReturnValue) == 0x0000CA, "Member 'W_SQMapCore_C_Hide_SL_Menu::CallFunc_IsSquadLeader_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.Create Actions Menu
// 0x0010 (0x0010 - 0x0000)
struct W_SQMapCore_C_Create_Actions_Menu final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_GridMenu_C*                          CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SQMapCore_C_Create_Actions_Menu) == 0x000008, "Wrong alignment on W_SQMapCore_C_Create_Actions_Menu");
static_assert(sizeof(W_SQMapCore_C_Create_Actions_Menu) == 0x000010, "Wrong size on W_SQMapCore_C_Create_Actions_Menu");
static_assert(offsetof(W_SQMapCore_C_Create_Actions_Menu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'W_SQMapCore_C_Create_Actions_Menu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Create_Actions_Menu, CallFunc_Create_ReturnValue) == 0x000008, "Member 'W_SQMapCore_C_Create_Actions_Menu::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.Remove Floating Widgets
// 0x0030 (0x0030 - 0x0000)
struct W_SQMapCore_C_Remove_Floating_Widgets final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_HUD_C>            K2Node_DynamicCast_AsBPI_HUD;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_SQMapCore_C_Remove_Floating_Widgets) == 0x000008, "Wrong alignment on W_SQMapCore_C_Remove_Floating_Widgets");
static_assert(sizeof(W_SQMapCore_C_Remove_Floating_Widgets) == 0x000030, "Wrong size on W_SQMapCore_C_Remove_Floating_Widgets");
static_assert(offsetof(W_SQMapCore_C_Remove_Floating_Widgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'W_SQMapCore_C_Remove_Floating_Widgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Remove_Floating_Widgets, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_SQMapCore_C_Remove_Floating_Widgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Remove_Floating_Widgets, CallFunc_GetHUD_ReturnValue) == 0x000010, "Member 'W_SQMapCore_C_Remove_Floating_Widgets::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Remove_Floating_Widgets, K2Node_DynamicCast_AsBPI_HUD) == 0x000018, "Member 'W_SQMapCore_C_Remove_Floating_Widgets::K2Node_DynamicCast_AsBPI_HUD' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_Remove_Floating_Widgets, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_SQMapCore_C_Remove_Floating_Widgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.OnMouseButtonUp
// 0x03C8 (0x03C8 - 0x0000)
struct W_SQMapCore_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            Result;                                            // 0x0160(0x00B8)(Edit, BlueprintVisible)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0218(0x00B8)()
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x02D0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E7[0x7];                                     // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1; // 0x02F0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E8[0x7];                                     // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0310(0x00B8)()
};
static_assert(alignof(W_SQMapCore_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on W_SQMapCore_C_OnMouseButtonUp");
static_assert(sizeof(W_SQMapCore_C_OnMouseButtonUp) == 0x0003C8, "Wrong size on W_SQMapCore_C_OnMouseButtonUp");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'W_SQMapCore_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'W_SQMapCore_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'W_SQMapCore_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, Result) == 0x000160, "Member 'W_SQMapCore_C_OnMouseButtonUp::Result' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000218, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x0002D0, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x0002E8, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1) == 0x0002F0, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000308, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseButtonUp, CallFunc_Unhandled_ReturnValue) == 0x000310, "Member 'W_SQMapCore_C_OnMouseButtonUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.OnMouseMove
// 0x0310 (0x0310 - 0x0000)
struct W_SQMapCore_C_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            Result;                                            // 0x0160(0x00B8)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48E9[0x6];                                     // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_MousePosition_C*                     CallFunc_Create_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetCursorDelta_ReturnValue;  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48EA[0x2];                                     // 0x023E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0258(0x00B8)()
};
static_assert(alignof(W_SQMapCore_C_OnMouseMove) == 0x000008, "Wrong alignment on W_SQMapCore_C_OnMouseMove");
static_assert(sizeof(W_SQMapCore_C_OnMouseMove) == 0x000310, "Wrong size on W_SQMapCore_C_OnMouseMove");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, MyGeometry) == 0x000000, "Member 'W_SQMapCore_C_OnMouseMove::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, MouseEvent) == 0x000038, "Member 'W_SQMapCore_C_OnMouseMove::MouseEvent' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, ReturnValue) == 0x0000A8, "Member 'W_SQMapCore_C_OnMouseMove::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, Result) == 0x000160, "Member 'W_SQMapCore_C_OnMouseMove::Result' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_IsValid_ReturnValue) == 0x000218, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_IsVisible_ReturnValue) == 0x000219, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_GetOwningPlayer_ReturnValue) == 0x000220, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_Create_ReturnValue) == 0x000228, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_PointerEvent_GetCursorDelta_ReturnValue) == 0x000230, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_PointerEvent_GetCursorDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_VSize2D_ReturnValue) == 0x000238, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00023C, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_BooleanAND_ReturnValue) == 0x00023D, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue) == 0x000240, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_PointerEvent_GetLastScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x000248, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000250, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_OnMouseMove, CallFunc_Unhandled_ReturnValue) == 0x000258, "Member 'W_SQMapCore_C_OnMouseMove::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.MovePan
// 0x0010 (0x0010 - 0x0000)
struct W_SQMapCore_C_MovePan final
{
public:
	struct FVector2D                              Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsScreenDelta;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48EB[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClampCacheScale;                                   // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SQMapCore_C_MovePan) == 0x000004, "Wrong alignment on W_SQMapCore_C_MovePan");
static_assert(sizeof(W_SQMapCore_C_MovePan) == 0x000010, "Wrong size on W_SQMapCore_C_MovePan");
static_assert(offsetof(W_SQMapCore_C_MovePan, Delta) == 0x000000, "Member 'W_SQMapCore_C_MovePan::Delta' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_MovePan, IsScreenDelta) == 0x000008, "Member 'W_SQMapCore_C_MovePan::IsScreenDelta' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_MovePan, ClampCacheScale) == 0x00000C, "Member 'W_SQMapCore_C_MovePan::ClampCacheScale' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.ScreenToPanVector
// 0x0070 (0x0070 - 0x0000)
struct W_SQMapCore_C_ScreenToPanVector final
{
public:
	struct FVector2D                              ScreenVector;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           PanLayer;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PanVector;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue_1;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_SQMapCore_C_ScreenToPanVector) == 0x000008, "Wrong alignment on W_SQMapCore_C_ScreenToPanVector");
static_assert(sizeof(W_SQMapCore_C_ScreenToPanVector) == 0x000070, "Wrong size on W_SQMapCore_C_ScreenToPanVector");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, ScreenVector) == 0x000000, "Member 'W_SQMapCore_C_ScreenToPanVector::ScreenVector' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, PanLayer) == 0x000008, "Member 'W_SQMapCore_C_ScreenToPanVector::PanLayer' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, PanVector) == 0x000010, "Member 'W_SQMapCore_C_ScreenToPanVector::PanVector' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, CallFunc_GetParent_ReturnValue) == 0x000018, "Member 'W_SQMapCore_C_ScreenToPanVector::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, CallFunc_GetCachedGeometry_ReturnValue) == 0x000020, "Member 'W_SQMapCore_C_ScreenToPanVector::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, CallFunc_AbsoluteToLocal_ReturnValue) == 0x000058, "Member 'W_SQMapCore_C_ScreenToPanVector::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, CallFunc_AbsoluteToLocal_ReturnValue_1) == 0x000060, "Member 'W_SQMapCore_C_ScreenToPanVector::CallFunc_AbsoluteToLocal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_SQMapCore_C_ScreenToPanVector, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000068, "Member 'W_SQMapCore_C_ScreenToPanVector::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function W_SQMapCore.W_SQMapCore_C.ClampPanPosition
// 0x0118 (0x0118 - 0x0000)
struct W_SQMapCore_C_ClampPanPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheScale;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48EC[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            RootLayer;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           PanLayer;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Result;                                            // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0030(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue_1;          // 0x0068(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToAbsolute_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
